[Survived] BlockStatement
src/App.jsx:17:29
   const [widgets, setWidgets] = useState([]);
   const [query, setQuery] = useState("");
 
-  const loadWidgets = () => {
-    fetch("/api/widgets")
-      .then((r) => r.json())
-      .then((data) => setWidgets(data.widgets))
-      .catch(() => setWidgets([]));
-  };
+  const loadWidgets = () => {};
 
   useEffect(loadWidgets, []);

[Survived] ArrowFunction
src/App.jsx:19:13
 
   const loadWidgets = () => {
     fetch("/api/widgets")
-      .then((r) => r.json())
+      .then(() => undefined)
       .then((data) => setWidgets(data.widgets))
       .catch(() => setWidgets([]));

[Survived] ArrowFunction
src/App.jsx:20:13
   const loadWidgets = () => {
     fetch("/api/widgets")
       .then((r) => r.json())
-      .then((data) => setWidgets(data.widgets))
+      .then(() => undefined)
       .catch(() => setWidgets([]));
   };

[Survived] ArrowFunction
src/App.jsx:21:14
     fetch("/api/widgets")
       .then((r) => r.json())
       .then((data) => setWidgets(data.widgets))
-      .catch(() => setWidgets([]));
+      .catch(() => undefined);
   };
 

[Survived] ArrayDeclaration
src/App.jsx:24:26
       .catch(() => setWidgets([]));
   };
 
-  useEffect(loadWidgets, []);
+  useEffect(loadWidgets, ["Stryker was here"]);
 
   const handleCreate = (label) => {

[Survived] BlockStatement
src/App.jsx:26:35
 
   useEffect(loadWidgets, []);
 
-  const handleCreate = (label) => {
-    fetch("/api/widgets", {
-      method: "POST",
-      headers: { "Content-Type": "application/json" },
-      body: JSON.stringify({ label }),
-    })
-      .then(() => loadWidgets())
-      .catch(() => {});
-  };
+  const handleCreate = (label) => {};
 
   const visible = filterWidgetsByLabel(widgets, query);

[Survived] ObjectLiteral
src/App.jsx:27:27
   useEffect(loadWidgets, []);
 
   const handleCreate = (label) => {
-    fetch("/api/widgets", {
-      method: "POST",
-      headers: { "Content-Type": "application/json" },
-      body: JSON.stringify({ label }),
-    })
+    fetch("/api/widgets", {})
       .then(() => loadWidgets())
       .catch(() => {});

[Survived] ObjectLiteral
src/App.jsx:30:28
     fetch("/api/widgets", {
       method: "POST",
       headers: { "Content-Type": "application/json" },
-      body: JSON.stringify({ label }),
+      body: JSON.stringify({}),
     })
       .then(() => loadWidgets())

[Survived] ArrowFunction
src/App.jsx:32:13
       headers: { "Content-Type": "application/json" },
       body: JSON.stringify({ label }),
     })
-      .then(() => loadWidgets())
+      .then(() => undefined)
       .catch(() => {});
   };

[Survived] ArrowFunction
src/App.jsx:45:22
       <Toolbar onCreate={handleCreate} />
       <SearchBar value={query} onChange={setQuery} />
       <ul>
-        {visible.map((w) => (
-          <li key={w.id}>{w.label}</li>
-        ))}
+        {visible.map(() => undefined)}
       </ul>
       <hr />
