[Survived] BlockStatement
src/components/Toolbar.jsx:3:47
 import PropTypes from "prop-types";
 
-export default function Toolbar({ onCreate }) {
-  const handleClick = () => {
-    const label = window.prompt("New widget label?");
-    if (label) onCreate(label);
-  };
-
-  return (
-    <div>
-      <button onClick={handleClick}>+ New widget</button>
-    </div>
-  );
-}
+export default function Toolbar({ onCreate }) {}
 
 Toolbar.propTypes = {

[Survived] BlockStatement
src/components/Toolbar.jsx:4:29
 import PropTypes from "prop-types";
 
 export default function Toolbar({ onCreate }) {
-  const handleClick = () => {
-    const label = window.prompt("New widget label?");
-    if (label) onCreate(label);
-  };
+  const handleClick = () => {};
 
   return (

[Survived] ConditionalExpression
src/components/Toolbar.jsx:6:9
 export default function Toolbar({ onCreate }) {
   const handleClick = () => {
     const label = window.prompt("New widget label?");
-    if (label) onCreate(label);
+    if (true) onCreate(label);
   };
 

[Survived] ConditionalExpression
src/components/Toolbar.jsx:6:9
 export default function Toolbar({ onCreate }) {
   const handleClick = () => {
     const label = window.prompt("New widget label?");
-    if (label) onCreate(label);
+    if (false) onCreate(label);
   };
 
