[Survived] BlockStatement
src/components/SearchBar.jsx:3:56
 import PropTypes from "prop-types";
 
-export default function SearchBar({ value, onChange }) {
-  return (
-    <input
-      type="search"
-      placeholder="Search widgets…"
-      value={value}
-      onChange={(e) => onChange(e.target.value)}
-    />
-  );
-}
+export default function SearchBar({ value, onChange }) {}
 
 SearchBar.propTypes = {

[Survived] ArrowFunction
src/components/SearchBar.jsx:9:17
       type="search"
       placeholder="Search widgets…"
       value={value}
-      onChange={(e) => onChange(e.target.value)}
+      onChange={() => undefined}
     />
   );
