[Killed] BlockStatement
src/filter.js:1:54
-export function filterWidgetsByLabel(widgets, query) {
-  const q = query.trim().toLowerCase();
-  if (!q) return widgets;
-  return widgets.filter((w) => w.label.toLowerCase().includes(q));
-}
+export function filterWidgetsByLabel(widgets, query) {}
 
killedBy: All tests
statusReason: > microfrontend-shell-react@1.0.0 test
> mocha test/**/*.test.js

[Killed] MethodExpression
src/filter.js:2:13
 export function filterWidgetsByLabel(widgets, query) {
-  const q = query.trim().toLowerCase();
+  const q = query.trim().toUpperCase();
   if (!q) return widgets;
   return widgets.filter((w) => w.label.toLowerCase().includes(q));
killedBy: All tests
statusReason: > microfrontend-shell-react@1.0.0 test
> mocha test/**/*.test.js

[Survived] MethodExpression
src/filter.js:2:13
 export function filterWidgetsByLabel(widgets, query) {
-  const q = query.trim().toLowerCase();
+  const q = query.toLowerCase();
   if (!q) return widgets;
   return widgets.filter((w) => w.label.toLowerCase().includes(q));

[Killed] BooleanLiteral
src/filter.js:3:7
 export function filterWidgetsByLabel(widgets, query) {
   const q = query.trim().toLowerCase();
-  if (!q) return widgets;
+  if (q) return widgets;
   return widgets.filter((w) => w.label.toLowerCase().includes(q));
 }
killedBy: All tests
statusReason: > microfrontend-shell-react@1.0.0 test
> mocha test/**/*.test.js

[Killed] ConditionalExpression
src/filter.js:3:7
 export function filterWidgetsByLabel(widgets, query) {
   const q = query.trim().toLowerCase();
-  if (!q) return widgets;
+  if (true) return widgets;
   return widgets.filter((w) => w.label.toLowerCase().includes(q));
 }
killedBy: All tests
statusReason: > microfrontend-shell-react@1.0.0 test
> mocha test/**/*.test.js

[Killed] MethodExpression
src/filter.js:4:32
 export function filterWidgetsByLabel(widgets, query) {
   const q = query.trim().toLowerCase();
   if (!q) return widgets;
-  return widgets.filter((w) => w.label.toLowerCase().includes(q));
+  return widgets.filter((w) => w.label.toUpperCase().includes(q));
 }
 
killedBy: All tests
statusReason: > microfrontend-shell-react@1.0.0 test
> mocha test/**/*.test.js

[Killed] MethodExpression
src/filter.js:4:10
 export function filterWidgetsByLabel(widgets, query) {
   const q = query.trim().toLowerCase();
   if (!q) return widgets;
-  return widgets.filter((w) => w.label.toLowerCase().includes(q));
+  return widgets;
 }
 
killedBy: All tests
statusReason: > microfrontend-shell-react@1.0.0 test
> mocha test/**/*.test.js
