[Killed] BlockStatement
src/widgets.js:1:42
-export function formatWidgetCount(count) {
-  return count === 1 ? "1 widget" : `${count} widgets`;
-}
+export function formatWidgetCount(count) {}
 
killedBy: All tests
statusReason: > microfrontend-shell-react@1.0.0 test
> mocha test/**/*.test.js





  filterWidgetsByLabel

[Killed] ConditionalExpression
src/widgets.js:2:10
 export function formatWidgetCount(count) {
-  return count === 1 ? "1 widget" : `${count} widgets`;
+  return true ? "1 widget" : `${count} widgets`;
 }
 
killedBy: All tests
statusReason: > microfrontend-shell-react@1.0.0 test
> mocha test/**/*.test.js

[Killed] EqualityOperator
src/widgets.js:2:10
 export function formatWidgetCount(count) {
-  return count === 1 ? "1 widget" : `${count} widgets`;
+  return count !== 1 ? "1 widget" : `${count} widgets`;
 }
 
killedBy: All tests
statusReason: > microfrontend-shell-react@1.0.0 test
> mocha test/**/*.test.js
